microchip-pic-avr-examples/dspic33ck-power-dcdc-dual-active-bridge-development-platform/dab-pwm-configuration.X/mcc_generated_files/pwm_hs/pwm.h
}  

/**
 * @ingroup    pwmhsdriver
 * @brief      This inline function disables ADC trigger 1 for the specific compare register 
 *             selected by the argument \ref PWM_GENERATOR.
 * @param[in]  genNum - PWM generator number
 * @param[in]  compareRegister - PWM generator number
 * @return     none  
 */
inline static void PWM_Trigger1Disable(enum PWM_GENERATOR genNum, enum PWM_TRIGGER_COMPARE compareRegister)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG1EVTLbits.ADTR1EN1 = 0;               
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG1EVTLbits.ADTR1EN2 = 0;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG1EVTLbits.ADTR1EN3 = 0;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_GENERATOR_2:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG2EVTLbits.ADTR1EN1 = 0;               
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG2EVTLbits.ADTR1EN2 = 0;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG2EVTLbits.ADTR1EN3 = 0;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_GENERATOR_3:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG3EVTLbits.ADTR1EN1 = 0;               
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG3EVTLbits.ADTR1EN2 = 0;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG3EVTLbits.ADTR1EN3 = 0;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_GENERATOR_4:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG4EVTLbits.ADTR1EN1 = 0;               
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG4EVTLbits.ADTR1EN2 = 0;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG4EVTLbits.ADTR1EN3 = 0;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_LEB:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG6EVTLbits.ADTR1EN1 = 0;               
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG6EVTLbits.ADTR1EN2 = 0;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG6EVTLbits.ADTR1EN3 = 0;
                                        break;                           
                        default:break;  
                }              
                break;       
        default:break;    
    }

}

/**
 * @ingroup    pwmhsdriver
 * @brief      This inline function enables ADC trigger 2 for the specific compare register 
 *             selected by the argument \ref PWM_GENERATOR.
 * @pre        Trigger value has to be set using \ref PWM_TriggerACompareValueSet, 
 *             \ref PWM_TriggerBCompareValueSet or \ref PWM_TriggerCCompareValueSet
 *             before calling this function.
 * @param[in]  genNum - PWM generator number
 * @param[in]  compareRegister - PWM generator number
 * @return     none  
 */
inline static void PWM_Trigger2Enable(enum PWM_GENERATOR genNum, enum PWM_TRIGGER_COMPARE compareRegister)
{
    switch(genNum) { 
        case PWM_GENERATOR_1:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG1EVTHbits.ADTR2EN1 = 1;               
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG1EVTHbits.ADTR2EN2 = 1;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG1EVTHbits.ADTR2EN3 = 1;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_GENERATOR_2:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG2EVTHbits.ADTR2EN1 = 1;               
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG2EVTHbits.ADTR2EN2 = 1;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG2EVTHbits.ADTR2EN3 = 1;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_GENERATOR_3:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG3EVTHbits.ADTR2EN1 = 1;               
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG3EVTHbits.ADTR2EN2 = 1;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG3EVTHbits.ADTR2EN3 = 1;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_GENERATOR_4:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG4EVTHbits.ADTR2EN1 = 1;               
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG4EVTHbits.ADTR2EN2 = 1;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG4EVTHbits.ADTR2EN3 = 1;
                                        break;                           
                        default:break;  
                }              
                break;       
        case PWM_LEB:
                switch(compareRegister) { 
                        case PWM_TRIGGER_COMPARE_A:
                                        PG6EVTHbits.ADTR2EN1 = 1;               
                                        break;       
                        case PWM_TRIGGER_COMPARE_B:
                                        PG6EVTHbits.ADTR2EN2 = 1;
                                        break;
                        case PWM_TRIGGER_COMPARE_C:
                                        PG6EVTHbits.ADTR2EN3 = 1;
                                        break;                           
                        default:break;  
                }              
                break;       
        default:break;    
    }

